content/wiki-xcom/ability-creator.md
+++
title = "Ability Creator"
author = ["TRNEEDANAME"]
date = 2025-11-03
layout = "page"
tags = ["wiki-xcom"]
draft = false
+++

## The mod {#the-mod}

The goal of this mod is to allow any players the ability to create abilities using only configuration.


## The config files {#the-config-files}


### Files {#files}

The config files are as follows :

-   `XComAbilityCreatorEffects.ini`
-   `XComAbilityCreatorMain.ini`


### Explanation {#explanation}


#### XComAbilityCreatorEffects {#xcomabilitycreatoreffects}

This file lists all of the effects that can be used to create abilities.


#### XComAbilityCreatorMain {#xcomabilitycreatormain}

This file is the main config, where abilities are created.
